class ActName < ActiveHash::Base
  self.data = [
    { id: 1, name: 'レジぶくろをもらわない' }, { id: 2, name: 'マイエコバッグを使う' }, { id: 3, name: 'マイはしを持ち歩く' },
    { id: 4, name: 'いらなくなったものを他の人にゆずる' }, { id: 5, name: '分べつしてごみをすてる' }, { id: 6, name: 'リサイクルされた物を買う' },
    { id: 7, name: 'ごみ拾いにさんかする' }, { id: 8, name: 'ペットボトルのキャップとラベルをはずして分べつする' }, { id: 9, name: 'こわれたものはしゅうりして使う' },
    { id: 10, name: '「もったいない」をさがす' }, { id: 11, name: '近くの場所に行くときは自転車に乗る' }, { id: 12, name: '近くの場所に行くときは歩く' },
    { id: 13, name: '電車に乗る' }, { id: 14, name: 'バスに乗る' }, { id: 15, name: '「生物多様性」についてまわりの人と話す' },
    { id: 16, name: '「地球温暖化」についてまわりの人と話す' }, { id: 17, name: '「ごみ問題」についてまわりの人と話す' }, { id: 18, name: '「絶めつ危ぐ種」についてまわりの人と話す' },
    { id: 19, name: '「３Ｒ」についてまわりの人と話す' }, { id: 20, name: '「オゾンそう」について周りの人とはなす' }, { id: 21, name: '「砂ばく化」についてまわりの人と話す' },
    { id: 22, name: 'ごはんをのこさず全部食べる' }, { id: 23, name: 'お皿のよごれをいらない紙でふきとってからあらう' }, { id: 24, name: 'シャワーの時間を短くする' },
    { id: 25, name: '水をだしっぱなしにしないようにする' }, { id: 26, name: 'テレビを見る時間をいつもより少なくする' }, { id: 27, name: '使わない電気をこまめに消す' },
    { id: 28, name: 'れいぞう庫をあけっぱなしにしないようにする' }, { id: 29, name: 'エアコンのフィルターをそうじする' }, { id: 30, name: '緑のカーテンを作る' },
    { id: 31, name: '家族と同じ部屋ですごす' }, { id: 32, name: '寒いときはもう１まいふくを着る' }, { id: 33, name: '寒いときはあたたかいものを食べる' },
    { id: 34, name: '暑いときは上着をぬぐ' }, { id: 35, name: '夏はエアコン温度を２８℃にする' }, { id: 36, name: '冬はエアコン温度を２０℃にする' }
  ]

end
